---
kind: type
id: T:Autodesk.Revit.DB.Macros.Macro
source: html/8e156c00-8aa8-51f5-be8f-4561ad51f1d8.htm
---
# Autodesk.Revit.DB.Macros.Macro

An individual Autodesk Revit Macro which can be executed.

## Syntax (C#)
```csharp
public class Macro : IDisposable
```